% % Получение Input и Target значений
% n = 5; 
% x1 = -2 : 1 : 2; 
% x2 = -2 : 1 : 2; 
% y = zeros(n, n); 
% s = 0;
% Input = zeros(2, 25); 
% Target = zeros(1, 25); 
% for j = 1 : n
%    for i = 1 : n
%        y(j, i) = (x1(j)^2) + (x2(i)^2) + (4 * x1(j) * x2(i)); 
%        s = s + 1;
%        Input(1, s) = x1(j); 
%        Input(2, s) = x2(i);
%        Target(1, s) = (x1(j)^2) + (x2(i)^2) + (4 * x1(j) * x2(i));
%    end
% end 
% Input
% Target


Target = [24 13 4 -3 -8 13 6 1 -2 -3 4 1 0 1 4 -3 -2 1 6 13 -8 -3 4 13 24]
Output = [21.0655 13.4369 4.2297 -2.3105 -5.4428 13.8795 5.7683 1.0122 -1.6243 -2.8249 4.2189 1.746 0.67427 0.74747 3.1493 -3.0978 -0.65892 1.6793 5.229 12.8413 -6.8164 -3.6189 3.131 12.8677 21.4618]

s1 = 0;
s2 = 0;
for (i = 1 : 25)
   s1 = s1 + ((Target(i) - Output(i))^2);
   s2 = s2 + (Target(i)^2);
end
s1 = s1^(1 / 2);
d = s1 / (s2^(1 / 2));
ans = d